[
    {
        "title": "Front-end Developer, Cheil (Samsung Ltd), London, UK - Oct 2020 - present",
        "experience": "Enhance Samsung.com UK experience through data-driven insights and user feedback.\nDevelop and test potential solutions for business-oriented strategies.\nExecute projects for MX (merchandising experience) pages, campaigns, launches, improvements, and offers.\nManage optimisation requests from IM divisions.\nDesign and develop custom full pages for Samsung's flagship smartphones\nCollaborate with Cheil and SES team to deliver digital solutions and customer support.\nDevelop tools and features for efficient management of Samsung UK's repair and support services."
    },
    {
        "title": "Front-end Developer, Freelance, London, UK - May 2020 - Oct 2020",
        "experience": "Building and exporting legacy PHP websites to modern content management systems.\nResponsible for migrating MySQL databases and creating new responsive front-end interfaces.\nDesigning and developing UI to fit business brand identity.\nAssist in managing website hosting including liaising with support remote teams to improve site speeds."
    },
    {
        "title": "Web developer, Four Communications, London, UK - Oct 2018 - Mar 2020",
        "experience": "Built bespoke client websites, databases, and web applications for clients such as the Estèe Lauder Group, NHS, the Booker Prize, and the Home Office.\nUtilized HTML/CSS, JavaScript, PHP, JQuery, React, and TypeScript to produce interactive UI.\nDeployed and maintained varied Cloud services including AWS, Google Cloud, and DigitalOcean.\nLed client-facing technical development and guidance for solutions and products with suppliers and colleagues, and provided creative guidance to business pitches."
    },
    {
        "title": "Junior Software developer, Eventogy, London, UK - Feb 2018 - Jun 2018",
        "experience": "Built a secure, cloud-based platform for corporate conferences and events management, aimed specifically at professional, legal, and finance industries.\nBuilt with HTML5, AngularJS, Express, Node.js, MongoDB, and Mongoose the platform was scalable and audit-compliant for event executives."
    },
    {
        "title": "Web developer, General Assembly, London, UK - Jul 2017 - Nov 2017",
        "experience": "Completed an intensive three-month full-time program in Full Stack Web Development\nBuilt four web apps utilizing technologies such as ReactJS, Express, Node.js, AngularJS, MongoDB, and Mongoose"
    }
]
